src/Catalogs/Обработчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Обработчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КонтекстыИсполненияОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СПредприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикSQL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/КонтекстыИсполненияОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>КонтекстыИсполненияОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтекстВнешнегоПодключения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтекстИнформационнойБазы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Обработчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭтаФорма.ТолькоПросмотр = Объект.Предопределенный;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТипОбработчикаПриИзменении(Элемент)
	
	Если Объект.ТипОбработчика = ПредопределенноеЗначение("Перечисление.ТипыОбработчиков.ОбработчикSQL") Тогда
		Объект.КонтекстИсполнения = ПредопределенноеЗначение("Перечисление.КонтекстыИсполненияОбработчиков.КонтекстВнешнегоПодключения");
	КонецЕсли;
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УправлениеДоступностьюЭлементовФормы()
	
	Элементы.КонтекстИсполнения.Доступность = (Объект.ТипОбработчика = ПредопределенноеЗначение("Перечисление.ТипыОбработчиков.Обработчик1СПредприятие"));
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)	
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры
